{smcl}
{com}{sf}{ul off}{txt}{.-}
       log:  {res}P:\Phase 4 Production (BIA)\Microdata\2007 Processing\Sample Programs\Stata\DiaryTable2007.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Feb 2009, 14:12:58
{txt}
{com}. do "C:\WINNT\Profiles\keil_e\LOCALS~1\Temp\STD00000000.tmp"
{txt}
{com}. cd C:\data\2007\STATA\Diary07
{res}C:\data\2007\STATA\Diary07
{txt}
{com}. set memory 100m
{txt}
{title:Current memory allocation}

{col 21}current{col 61}memory usage
{col 5}settable{col 23}value{col 33}description{col 61}(1M = 1024k)
{col 5}{hline 68}
{col 5}set maxvar{col 22}{res:  5000}{col 33}max. variables allowed           1.733M
{col 5}set memory          {res:100M}{col 33}max. data space                100.000M
{col 5}set matsize{col 21}{res:    400}{col 33}max. RHS vars in models          1.254M
{col 61}{hline 11}
{col 55}         102.987M

{com}. 
. infix  str type 1  str agglvl 4  str title 7-69  ///
>        str ucc 70-75  str survey 80  str group 86-93  ///
>        str publvl 99  using Dstub2007.txt
{txt}(792 observations read)

{com}.         keep if type=="1"
{txt}(40 observations deleted)

{com}.         drop if group=="ADDENDA"
{txt}(273 observations deleted)

{com}.         format title %-63s
{txt}
{com}. save stubfile
{txt}file stubfile.dta saved

{com}. 
. generate count = (_n+9999)
{txt}
{com}. generate line = string(count) + agglvl
{txt}
{com}.         generate line1=line if ucc>"A" & substr(line,6,1)=="1"
{txt}(459 missing values generated)

{com}.         generate line2=line if ucc>"A" & substr(line,6,1)=="2"
{txt}(444 missing values generated)

{com}.         generate line3=line if ucc>"A" & substr(line,6,1)=="3"
{txt}(447 missing values generated)

{com}.         generate line4=line if ucc>"A" & substr(line,6,1)=="4"
{txt}(456 missing values generated)

{com}.         generate line5=line if ucc>"A" & substr(line,6,1)=="5"
{txt}(463 missing values generated)

{com}.         generate line6=line if ucc <= "A"
{txt}(126 missing values generated)

{com}. sort line
{txt}
{com}. save aggfile1
{txt}file aggfile1.dta saved

{com}. 
. keep title line
{txt}
{com}. save lblfile
{txt}file lblfile.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep line ucc
{txt}
{com}.         sort line
{txt}
{com}. save l
{txt}file l.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep if line1 > " "
{txt}(459 observations deleted)

{com}.         keep line line1
{txt}
{com}. save l1
{txt}file l1.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep if line2 > " "
{txt}(444 observations deleted)

{com}.         keep line line2
{txt}
{com}. save l2
{txt}file l2.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep if line3 > " "
{txt}(447 observations deleted)

{com}.         keep line line3
{txt}
{com}. save l3
{txt}file l3.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep if line4 > " "
{txt}(456 observations deleted)

{com}.         keep line line4
{txt}
{com}. save l4
{txt}file l4.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep if line5 > " "
{txt}(463 observations deleted)

{com}.         keep line line5
{txt}
{com}. save l5
{txt}file l5.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep if line6 > " "
{txt}(126 observations deleted)

{com}.         keep ucc line line6
{txt}
{com}.         sort line
{txt}
{com}. save l6
{txt}file l6.dta saved

{com}. 
. use l
{txt}
{com}.         cross using l1
{txt}
{com}.         drop if line1 > line
{txt}(5393 observations deleted)

{com}.         gsort +line -line1
{txt}
{com}.         duplicates drop line, force

{p 0 4}{txt}Duplicates in terms of {res} line{p_end}

{txt}(3708 observations deleted)

{com}. save c1
{txt}file c1.dta saved

{com}. 
. cross using l2
{txt}
{com}.         drop if line2 > line
{txt}(12334 observations deleted)

{com}.         gsort +line -line2
{txt}
{com}.         duplicates drop line, force

{p 0 4}{txt}Duplicates in terms of {res} line{p_end}

{txt}(3987 observations deleted)

{com}. save c2
{txt}file c2.dta saved

{com}. 
. cross using l3
{txt}
{com}.         drop if line3 > line
{txt}(7046 observations deleted)

{com}.         gsort +line -line3
{txt}
{com}.         duplicates drop line, force

{p 0 4}{txt}Duplicates in terms of {res} line{p_end}

{txt}(6719 observations deleted)

{com}. save c3
{txt}file c3.dta saved

{com}. 
. cross using l4
{txt}
{com}.         drop if line4 > line
{txt}(2181 observations deleted)

{com}.         gsort +line -line4
{txt}
{com}.         duplicates drop line, force

{p 0 4}{txt}Duplicates in terms of {res} line{p_end}

{txt}(7566 observations deleted)

{com}. save c4
{txt}file c4.dta saved

{com}. 
. cross using l5
{txt}
{com}.         drop if line5 > line
{txt}(1032 observations deleted)

{com}.         gsort +line -line5
{txt}
{com}.         duplicates drop line, force

{p 0 4}{txt}Duplicates in terms of {res} line{p_end}

{txt}(5605 observations deleted)

{com}. save c5
{txt}file c5.dta saved

{com}. 
. use l
{txt}
{com}. merge line using c1 c2 c3 c4 c5 l6, sort
{txt}
{com}.         drop _merge* line
{txt}
{com}.         drop if line6==""
{txt}(126 observations deleted)

{com}. sort ucc
{txt}
{com}. 
. stack  ucc line6 line1  ucc line6 line2  ucc line6 line3  ///
>        ucc line6 line4  ucc line6 line5  ucc line6 line6  ///
>        ,into(ucc compare line)  clear
{txt}
{com}. drop if line==""
{txt}(121 observations deleted)

{com}. 
. keep if substr(compare,6,1) > substr(line,6,1) | compare==line
{txt}(581 observations deleted)

{com}.         sort ucc line
{txt}
{com}.         drop _stack compare
{txt}
{com}. save aggfile
{txt}file aggfile.dta saved

{com}. 
. 
. use fmld071
{txt}
{com}. keep newid finlwt21 inclass
{txt}
{com}.         append using fmld072, keep(newid finlwt21 inclass)
{txt}
{com}.         append using fmld073, keep(newid finlwt21 inclass)
{txt}
{com}.         append using fmld074, keep(newid finlwt21 inclass)
{txt}
{com}. generate weight=finlwt21/4
{txt}
{com}. sort newid
{txt}
{com}. describe

{txt}Contains data from {res}fmld071.dta
{txt}  obs:{res}        13,747                          
{txt} vars:{res}             4                          
{txt} size:{res}       302,434{txt} (99.7% of memory free)
{hline 79}
              storage  display     value
variable name   type   format      label      variable label
{hline 79}
{res}newid          {txt} long   %12.0g                 {res}
finlwt21       {txt} double %10.0g                 {res}
inclass        {txt} str2   %2s                    {res}
weight         {txt} float  %9.0g                  {res}
{txt}{hline 79}
Sorted by:  {res}newid
     Note:  dataset has changed since last saved
{txt}
{com}. list newid inclass finlwt21 weight in 1/15, divider
{txt}
     {c TLC}{hline 8}{c TT}{hline 9}{c TT}{hline 11}{c TT}{hline 10}{c TRC}
     {c |} {res} newid {txt}{c |} {res}inclass {txt}{c |} {res} finlwt21 {txt}{c |} {res}  weight {txt}{c |}
     {c LT}{hline 8}{c +}{hline 9}{c +}{hline 11}{c +}{hline 10}{c RT}
  1. {c |} {res}816991 {txt}{c |} {res}     07 {txt}{c |} {res}49981.677 {txt}{c |} {res}12495.42 {txt}{c |}
  2. {c |} {res}816992 {txt}{c |} {res}     07 {txt}{c |} {res}49981.677 {txt}{c |} {res}12495.42 {txt}{c |}
  3. {c |} {res}817001 {txt}{c |} {res}     03 {txt}{c |} {res}35469.451 {txt}{c |} {res}8867.362 {txt}{c |}
  4. {c |} {res}817002 {txt}{c |} {res}     03 {txt}{c |} {res}35469.451 {txt}{c |} {res}8867.362 {txt}{c |}
  5. {c |} {res}817011 {txt}{c |} {res}     08 {txt}{c |} {res}52465.518 {txt}{c |} {res}13116.38 {txt}{c |}
     {c LT}{hline 8}{c +}{hline 9}{c +}{hline 11}{c +}{hline 10}{c RT}
  6. {c |} {res}817012 {txt}{c |} {res}     08 {txt}{c |} {res}52465.518 {txt}{c |} {res}13116.38 {txt}{c |}
  7. {c |} {res}817021 {txt}{c |} {res}     07 {txt}{c |} {res}21457.595 {txt}{c |} {res}5364.399 {txt}{c |}
  8. {c |} {res}817022 {txt}{c |} {res}     07 {txt}{c |} {res}21457.595 {txt}{c |} {res}5364.399 {txt}{c |}
  9. {c |} {res}817031 {txt}{c |} {res}     09 {txt}{c |} {res}67425.286 {txt}{c |} {res}16856.32 {txt}{c |}
 10. {c |} {res}817032 {txt}{c |} {res}     09 {txt}{c |} {res}67425.286 {txt}{c |} {res}16856.32 {txt}{c |}
     {c LT}{hline 8}{c +}{hline 9}{c +}{hline 11}{c +}{hline 10}{c RT}
 11. {c |} {res}817041 {txt}{c |} {res}     04 {txt}{c |} {res} 31588.85 {txt}{c |} {res}7897.212 {txt}{c |}
 12. {c |} {res}817051 {txt}{c |} {res}     09 {txt}{c |} {res}23377.432 {txt}{c |} {res}5844.358 {txt}{c |}
 13. {c |} {res}817052 {txt}{c |} {res}     09 {txt}{c |} {res}23377.432 {txt}{c |} {res}5844.358 {txt}{c |}
 14. {c |} {res}817061 {txt}{c |} {res}     09 {txt}{c |} {res}57219.262 {txt}{c |} {res}14304.82 {txt}{c |}
 15. {c |} {res}817062 {txt}{c |} {res}     09 {txt}{c |} {res}57219.262 {txt}{c |} {res}14304.82 {txt}{c |}
     {c BLC}{hline 8}{c BT}{hline 9}{c BT}{hline 11}{c BT}{hline 10}{c BRC}

{com}. save fmly
{txt}file fmly.dta saved

{com}. 
. use dtbd071
{txt}
{com}. keep newid ucc amount
{txt}
{com}.         append using dtbd072, keep(newid ucc amount)
{txt}
{com}.         append using dtbd073, keep(newid ucc amount)
{txt}
{com}.         append using dtbd074, keep(newid ucc amount)
{txt}
{com}. rename amount cost
{txt}
{com}.         append using expd071, keep(newid ucc cost)
{txt}cost was {res}long{txt} now {res}double
{txt}
{com}.         append using expd072, keep(newid ucc cost)
{txt}
{com}.         append using expd073, keep(newid ucc cost)
{txt}
{com}.         append using expd074, keep(newid ucc cost)
{txt}
{com}. sort newid
{txt}
{com}. describe

{txt}Contains data from {res}dtbd071.dta
{txt}  obs:{res}       750,787                          
{txt} vars:{res}             3                          
{txt} size:{res}    16,517,314{txt} (84.2% of memory free)
{hline 79}
              storage  display     value
variable name   type   format      label      variable label
{hline 79}
{res}newid          {txt} long   %12.0g                 {res}
ucc            {txt} str6   %6s                    {res}
cost           {txt} double %12.0g                 {res}
{txt}{hline 79}
Sorted by:  {res}newid
     Note:  dataset has changed since last saved
{txt}
{com}. list newid ucc cost in 1/15, divider
{txt}
     {c TLC}{hline 8}{c TT}{hline 8}{c TT}{hline 13}{c TRC}
     {c |} {res} newid {txt}{c |} {res}   ucc {txt}{c |} {res}       cost {txt}{c |}
     {c LT}{hline 8}{c +}{hline 8}{c +}{hline 13}{c RT}
  1. {c |} {res}816991 {txt}{c |} {res}330510 {txt}{c |} {res}.9399999976 {txt}{c |}
  2. {c |} {res}816991 {txt}{c |} {res}330510 {txt}{c |} {res}2.119999886 {txt}{c |}
  3. {c |} {res}816991 {txt}{c |} {res}140420 {txt}{c |} {res}1.517510056 {txt}{c |}
  4. {c |} {res}816991 {txt}{c |} {res}330110 {txt}{c |} {res}.6376900077 {txt}{c |}
  5. {c |} {res}816991 {txt}{c |} {res}640120 {txt}{c |} {res}1.269999981 {txt}{c |}
     {c LT}{hline 8}{c +}{hline 8}{c +}{hline 13}{c RT}
  6. {c |} {res}816991 {txt}{c |} {res}330210 {txt}{c |} {res}.8399999738 {txt}{c |}
  7. {c |} {res}816991 {txt}{c |} {res}190211 {txt}{c |} {res}2.400000095 {txt}{c |}
  8. {c |} {res}816991 {txt}{c |} {res}180310 {txt}{c |} {res}1.600000024 {txt}{c |}
  9. {c |} {res}816991 {txt}{c |} {res}980020 {txt}{c |} {res}         35 {txt}{c |}
 10. {c |} {res}816991 {txt}{c |} {res}980330 {txt}{c |} {res}        100 {txt}{c |}
     {c LT}{hline 8}{c +}{hline 8}{c +}{hline 13}{c RT}
 11. {c |} {res}816991 {txt}{c |} {res}640310 {txt}{c |} {res}1.059999943 {txt}{c |}
 12. {c |} {res}816991 {txt}{c |} {res}200522 {txt}{c |} {res}7.940000057 {txt}{c |}
 13. {c |} {res}816991 {txt}{c |} {res}980260 {txt}{c |} {res}        100 {txt}{c |}
 14. {c |} {res}816991 {txt}{c |} {res}900131 {txt}{c |} {res}      11400 {txt}{c |}
 15. {c |} {res}816991 {txt}{c |} {res}640310 {txt}{c |} {res}2.650000095 {txt}{c |}
     {c BLC}{hline 8}{c BT}{hline 8}{c BT}{hline 13}{c BRC}

{com}. save expend
{txt}file expend.dta saved

{com}. 
. use fmly
{txt}
{com}.         joinby newid using expend, unmatched(using)
{txt}
{com}. generate wtcost=cost*weight
{txt}
{com}. sort ucc
{txt}
{com}. describe

{txt}Contains data
  obs:{res}       750,787                          
{txt} vars:{res}             8                          
{txt} size:{res}    30,782,267{txt} (70.6% of memory free)
{hline 79}
              storage  display     value
variable name   type   format      label      variable label
{hline 79}
{res}newid          {txt} long   %12.0g                 {res}
finlwt21       {txt} double %10.0g                 {res}
inclass        {txt} str2   %2s                    {res}
weight         {txt} float  %9.0g                  {res}
_merge         {txt} byte   %29.0g      __MERGE    {res}
ucc            {txt} str6   %6s                    {res}
cost           {txt} double %12.0g                 {res}
wtcost         {txt} float  %9.0g                  {res}
{txt}{hline 79}
Sorted by:  {res}ucc
     Note:  dataset has changed since last saved
{txt}
{com}. list newid inclass ucc weight cost wtcost in 1/15, divider
{txt}
     {c TLC}{hline 8}{c TT}{hline 9}{c TT}{hline 8}{c TT}{hline 10}{c TT}{hline 13}{c TT}{hline 10}{c TRC}
     {c |} {res} newid {txt}{c |} {res}inclass {txt}{c |} {res}   ucc {txt}{c |} {res}  weight {txt}{c |} {res}       cost {txt}{c |} {res}  wtcost {txt}{c |}
     {c LT}{hline 8}{c +}{hline 9}{c +}{hline 8}{c +}{hline 10}{c +}{hline 13}{c +}{hline 10}{c RT}
  1. {c |} {res}884072 {txt}{c |} {res}     06 {txt}{c |} {res}001000 {txt}{c |} {res}7159.434 {txt}{c |} {res}        107 {txt}{c |} {res}766059.4 {txt}{c |}
  2. {c |} {res}879021 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}11776.97 {txt}{c |} {res}        106 {txt}{c |} {res} 1248359 {txt}{c |}
  3. {c |} {res}888492 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}13788.39 {txt}{c |} {res}      106.5 {txt}{c |} {res} 1468463 {txt}{c |}
  4. {c |} {res}820061 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}19915.57 {txt}{c |} {res}      10626 {txt}{c |} {res}2.12e+08 {txt}{c |}
  5. {c |} {res}870822 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}6551.773 {txt}{c |} {res}31.79999924 {txt}{c |} {res}208346.4 {txt}{c |}
     {c LT}{hline 8}{c +}{hline 9}{c +}{hline 8}{c +}{hline 10}{c +}{hline 13}{c +}{hline 10}{c RT}
  6. {c |} {res}872022 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}6624.772 {txt}{c |} {res}        214 {txt}{c |} {res} 1417701 {txt}{c |}
  7. {c |} {res}854022 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}8765.339 {txt}{c |} {res}13.38000011 {txt}{c |} {res}117280.2 {txt}{c |}
  8. {c |} {res}857302 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}11990.21 {txt}{c |} {res}81.94000244 {txt}{c |} {res}982477.8 {txt}{c |}
  9. {c |} {res}827952 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}7550.663 {txt}{c |} {res}13.47000027 {txt}{c |} {res}101707.4 {txt}{c |}
 10. {c |} {res}843242 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}10191.68 {txt}{c |} {res}        106 {txt}{c |} {res} 1080319 {txt}{c |}
     {c LT}{hline 8}{c +}{hline 9}{c +}{hline 8}{c +}{hline 10}{c +}{hline 13}{c +}{hline 10}{c RT}
 11. {c |} {res}833592 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}6528.578 {txt}{c |} {res}26.37999916 {txt}{c |} {res}172223.9 {txt}{c |}
 12. {c |} {res}888492 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}13788.39 {txt}{c |} {res}      106.5 {txt}{c |} {res} 1468463 {txt}{c |}
 13. {c |} {res}888492 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}13788.39 {txt}{c |} {res}      106.5 {txt}{c |} {res} 1468463 {txt}{c |}
 14. {c |} {res}865591 {txt}{c |} {res}     06 {txt}{c |} {res}001000 {txt}{c |} {res}11282.05 {txt}{c |} {res}        106 {txt}{c |} {res} 1195897 {txt}{c |}
 15. {c |} {res}820681 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}9077.027 {txt}{c |} {res}124.7343979 {txt}{c |} {res} 1132218 {txt}{c |}
     {c BLC}{hline 8}{c BT}{hline 9}{c BT}{hline 8}{c BT}{hline 10}{c BT}{hline 13}{c BT}{hline 10}{c BRC}

{com}. save tabdata
{txt}file tabdata.dta saved

{com}. 
. use fmly
{txt}
{com}.         statsby pops=r(sum), saving(pops1) by(inclass, missing) nodots: sum weight
{p2colset 7 17 21 2}{...}

{txt}{p2col :command:}summarize weight{p_end}
{p2colset 10 17 21 2}{...}
{p2col :pops:}{res:r(sum)}{p_end}
           by:  inclass


{com}. 
. use pops1
{txt}(statsby: summarize)

{com}.       gen _varname="pop"+inclass
{txt}
{com}.       drop inclass
{txt}
{com}.       xpose, clear varname
{txt}
{com}.       egen pop10=rsum(pop01-pop09)
{txt}
{com}.       xpose, clear varname
{txt}
{com}.       gen inclass=substr(_varname,4,2)
{txt}
{com}.       drop _varname
{txt}
{com}. save pops
{txt}file pops.dta saved

{com}. 
. use tabdata
{txt}
{com}.         statsby aggs=r(sum), saving(agg1) by(inclass ucc, missing) nodots: sum wtcost
{p2colset 7 17 21 2}{...}

{txt}{p2col :command:}summarize wtcost{p_end}
{p2colset 10 17 21 2}{...}
{p2col :aggs:}{res:r(sum)}{p_end}
           by:  inclass ucc


{com}. 
. use agg1
{txt}(statsby: summarize)

{com}.       reshape wide aggs, i(ucc) j(inclass) string
{txt}(note: j = 01 02 03 04 05 06 07 08 09)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}    4257   {txt}->{res}     555
{txt}Number of variables            {res}       3   {txt}->{res}      10
{txt}j variable (9 values)           {res}inclass   {txt}->   (dropped)
xij variables:
                                   {res}aggs   {txt}->   {res}aggs01 aggs02 ... aggs09
{txt}{hline 77}

{com}.       egen aggs10=rsum(aggs01-aggs09)
{txt}
{com}.       reshape long aggs, i(ucc) j(inclass) string
{txt}(note: j = 01 02 03 04 05 06 07 08 09 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     555   {txt}->{res}    5550
{txt}Number of variables            {res}      11   {txt}->{res}       3
{txt}j variable (10 values)                    ->   {res}inclass
{txt}xij variables:
               {res}aggs01 aggs02 ... aggs10   {txt}->   {res}aggs
{txt}{hline 77}

{com}. save agg2
{txt}file agg2.dta saved

{com}. 
. use pops
{txt}
{com}.         joinby inclass using agg2, unmatched(using)
{txt}
{com}.         generate uccmean=aggs/pops
{txt}(738 missing values generated)

{com}.         format pops aggs uccmean %16.2g
{txt}
{com}. describe

{txt}Contains data
  obs:{res}         5,550                          
{txt} vars:{res}             6                          
{txt} size:{res}       138,750{txt} (99.9% of memory free)
{hline 79}
              storage  display     value
variable name   type   format      label      variable label
{hline 79}
{res}pops           {txt} float  %16.2g                 {res}
inclass        {txt} str2   %9s                    {res}
_merge         {txt} byte   %29.0g      __MERGE    {res}
ucc            {txt} str6   %9s                    {res}
aggs           {txt} float  %16.2g                 {res}
uccmean        {txt} float  %16.2g                 {res}
{txt}{hline 79}
Sorted by:  
{res}     Note:  dataset has changed since last saved
{txt}
{com}. list inclass ucc pops aggs uccmean in 1/15, divider
{txt}
     {c TLC}{hline 9}{c TT}{hline 8}{c TT}{hline 9}{c TT}{hline 10}{c TT}{hline 9}{c TRC}
     {c |} {res}inclass {txt}{c |} {res}   ucc {txt}{c |} {res}   pops {txt}{c |} {res}    aggs {txt}{c |} {res}uccmean {txt}{c |}
     {c LT}{hline 9}{c +}{hline 8}{c +}{hline 9}{c +}{hline 10}{c +}{hline 9}{c RT}
  1. {c |} {res}     01 {txt}{c |} {res}600120 {txt}{c |} {res}3310151 {txt}{c |} {res}       . {txt}{c |} {res}      . {txt}{c |}
  2. {c |} {res}     01 {txt}{c |} {res}190212 {txt}{c |} {res}3310151 {txt}{c |} {res}17173224 {txt}{c |} {res}    5.2 {txt}{c |}
  3. {c |} {res}     01 {txt}{c |} {res}620913 {txt}{c |} {res}3310151 {txt}{c |} {res}       . {txt}{c |} {res}      . {txt}{c |}
  4. {c |} {res}     01 {txt}{c |} {res}170520 {txt}{c |} {res}3310151 {txt}{c |} {res}  889130 {txt}{c |} {res}    .27 {txt}{c |}
  5. {c |} {res}     01 {txt}{c |} {res}340410 {txt}{c |} {res}3310151 {txt}{c |} {res}       . {txt}{c |} {res}      . {txt}{c |}
     {c LT}{hline 9}{c +}{hline 8}{c +}{hline 9}{c +}{hline 10}{c +}{hline 9}{c RT}
  6. {c |} {res}     01 {txt}{c |} {res}150310 {txt}{c |} {res}3310151 {txt}{c |} {res}  896398 {txt}{c |} {res}    .27 {txt}{c |}
  7. {c |} {res}     01 {txt}{c |} {res}230140 {txt}{c |} {res}3310151 {txt}{c |} {res}       . {txt}{c |} {res}      . {txt}{c |}
  8. {c |} {res}     01 {txt}{c |} {res}600410 {txt}{c |} {res}3310151 {txt}{c |} {res}  157327 {txt}{c |} {res}   .048 {txt}{c |}
  9. {c |} {res}     01 {txt}{c |} {res}590220 {txt}{c |} {res}3310151 {txt}{c |} {res}       . {txt}{c |} {res}      . {txt}{c |}
 10. {c |} {res}     01 {txt}{c |} {res}320430 {txt}{c |} {res}3310151 {txt}{c |} {res}       . {txt}{c |} {res}      . {txt}{c |}
     {c LT}{hline 9}{c +}{hline 8}{c +}{hline 9}{c +}{hline 10}{c +}{hline 9}{c RT}
 11. {c |} {res}     01 {txt}{c |} {res}320340 {txt}{c |} {res}3310151 {txt}{c |} {res}   14534 {txt}{c |} {res}  .0044 {txt}{c |}
 12. {c |} {res}     01 {txt}{c |} {res}610902 {txt}{c |} {res}3310151 {txt}{c |} {res}       . {txt}{c |} {res}      . {txt}{c |}
 13. {c |} {res}     01 {txt}{c |} {res}120310 {txt}{c |} {res}3310151 {txt}{c |} {res} 1190422 {txt}{c |} {res}    .36 {txt}{c |}
 14. {c |} {res}     01 {txt}{c |} {res}230000 {txt}{c |} {res}3310151 {txt}{c |} {res}       . {txt}{c |} {res}      . {txt}{c |}
 15. {c |} {res}     01 {txt}{c |} {res}670901 {txt}{c |} {res}3310151 {txt}{c |} {res}       . {txt}{c |} {res}      . {txt}{c |}
     {c BLC}{hline 9}{c BT}{hline 8}{c BT}{hline 9}{c BT}{hline 10}{c BT}{hline 9}{c BRC}

{com}.         sort inclass ucc
{txt}
{com}.         keep inclass ucc uccmean
{txt}
{com}. save tab1
{txt}file tab1.dta saved

{com}. 
. reshape wide uccmean, i(ucc) j(inclass) string
{txt}(note: j = 01 02 03 04 05 06 07 08 09 10)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}    5550   {txt}->{res}     555
{txt}Number of variables            {res}       3   {txt}->{res}      11
{txt}j variable (10 values)          {res}inclass   {txt}->   (dropped)
xij variables:
                                {res}uccmean   {txt}->   {res}uccmean01 uccmean02 ... uccmean10
{txt}{hline 77}

{com}. save tab2
{txt}file tab2.dta saved

{com}. 
. merge ucc using aggfile
{txt}{p 0 4}
variable{txt} ucc
does not uniquely identify observations in
aggfile.dta
{p_end}

{com}.         keep if _merge==3
{txt}(272 observations deleted)

{com}.         drop _merge
{txt}
{com}.         sort line
{txt}
{com}.                 by line, sort: egen Inclass01 = sum(uccmean01)
{txt}
{com}.                 by line, sort: egen Inclass02 = sum(uccmean02)
{txt}
{com}.                 by line, sort: egen Inclass03 = sum(uccmean03)
{txt}
{com}.                 by line, sort: egen Inclass04 = sum(uccmean04)
{txt}
{com}.                 by line, sort: egen Inclass05 = sum(uccmean05)
{txt}
{com}.                 by line, sort: egen Inclass06 = sum(uccmean06)
{txt}
{com}.                 by line, sort: egen Inclass07 = sum(uccmean07)
{txt}
{com}.                 by line, sort: egen Inclass08 = sum(uccmean08)
{txt}
{com}.                 by line, sort: egen Inclass09 = sum(uccmean09)
{txt}
{com}.                 by line, sort: egen Inclass10 = sum(uccmean10)
{txt}
{com}.         drop ucc uccmean*
{txt}
{com}.         duplicates drop line, force

{p 0 4}{txt}Duplicates in terms of {res} line{p_end}

{txt}(901 observations deleted)

{com}. save tab
{txt}file tab.dta saved

{com}. 
. use lblfile
{txt}
{com}. merge line using tab
{txt}
{com}.         keep if _merge==3
{txt}(14 observations deleted)

{com}.                 format Inclass01 %10.2fc
{txt}
{com}.                 format Inclass02 %10.2fc
{txt}
{com}.                 format Inclass03 %10.2fc
{txt}
{com}.                 format Inclass04 %10.2fc
{txt}
{com}.                 format Inclass05 %10.2fc
{txt}
{com}.                 format Inclass06 %10.2fc
{txt}
{com}.                 format Inclass07 %10.2fc
{txt}
{com}.                 format Inclass08 %10.2fc
{txt}
{com}.                 format Inclass09 %10.2fc
{txt}
{com}.                 format Inclass10 %10.2fc
{txt}
{com}.                 label variable Inclass01 "Less than $5,000"
{txt}
{com}.                 label variable Inclass02 "$5,000 to $9,999"
{txt}
{com}.                 label variable Inclass03 "$10,000 to $14,999"
{txt}
{com}.                 label variable Inclass04 "$15,000 to $19,999"
{txt}
{com}.                 label variable Inclass05 "$20,000 to $29,000"
{txt}
{com}.                 label variable Inclass06 "$30,000 to $39,999"
{txt}
{com}.                 label variable Inclass07 "$40,000 to $49,999"
{txt}
{com}.                 label variable Inclass08 "$50,000 to $69,999"
{txt}
{com}.                 label variable Inclass09 "$70,000 and over"
{txt}
{com}.                 label variable Inclass10 "Incomplete Reporters"
{txt}
{com}.                 label variable title "Item"
{txt}
{com}.         drop line _merge
{txt}
{com}. save DiaryTable
{txt}file DiaryTable.dta saved

{com}. 
. outsheet  title Inclass01 Inclass02 Inclass03 Inclass04 Inclass05 ///
>                 Inclass06 Inclass07 Inclass08 Inclass09 Inclass10 ///
>           using DiaryTable, noquote
{txt}
{com}. 
{txt}end of do-file

{com}. log close
       {txt}log:  {res}P:\Phase 4 Production (BIA)\Microdata\2007 Processing\Sample Programs\Stata\DiaryTable2007.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Feb 2009, 14:13:46
{txt}{.-}
{smcl}
{txt}{sf}{ul off}