{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\2011_CEX\PROGRAMS\Stata\Diary Table2011.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}24 Sep 2012, 11:46:25

{com}. do "C:\2011_CEX\PROGRAMS\Stata\DiaryTable2011.do"
{txt}
{com}. 
. 
. set memory 200m
{txt}(204800k)

{com}. 
. cd C:\2011_CEX\PROGRAMS
{res}C:\2011_CEX\PROGRAMS
{txt}
{com}. infix  str type 1  str agglvl 4  str title 7-69  ///
>        str ucc 70-75  str survey 80  str group 86-93  ///
>        str publvl 99  using Dstub2011.txt
{txt}(808 observations read)

{com}.         keep if type=="1"
{txt}(41 observations deleted)

{com}.         drop if group=="ADDENDA"
{txt}(280 observations deleted)

{com}.         format title %-63s
{txt}
{com}. 
. cd C:\2011_CEX\Diary11
{res}C:\2011_CEX\Diary11
{txt}
{com}. 
. save stubfile
{txt}file stubfile.dta saved

{com}. 
. generate count = (_n+9999)
{txt}
{com}. generate line = string(count) + agglvl
{txt}
{com}.         generate line1=line if ucc>"A" & substr(line,6,1)=="1"
{txt}(467 missing values generated)

{com}.         generate line2=line if ucc>"A" & substr(line,6,1)=="2"
{txt}(452 missing values generated)

{com}.         generate line3=line if ucc>"A" & substr(line,6,1)=="3"
{txt}(455 missing values generated)

{com}.         generate line4=line if ucc>"A" & substr(line,6,1)=="4"
{txt}(464 missing values generated)

{com}.         generate line5=line if ucc>"A" & substr(line,6,1)=="5"
{txt}(471 missing values generated)

{com}.         generate line6=line if ucc <= "A"
{txt}(126 missing values generated)

{com}. sort line
{txt}
{com}. save aggfile1
{txt}file aggfile1.dta saved

{com}. 
. keep title line
{txt}
{com}. save lblfile
{txt}file lblfile.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep line ucc
{txt}
{com}.         sort line
{txt}
{com}. save l
{txt}file l.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep if line1 > " "
{txt}(467 observations deleted)

{com}.         keep line line1
{txt}
{com}. save l1
{txt}file l1.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep if line2 > " "
{txt}(452 observations deleted)

{com}.         keep line line2
{txt}
{com}. save l2
{txt}file l2.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep if line3 > " "
{txt}(455 observations deleted)

{com}.         keep line line3
{txt}
{com}. save l3
{txt}file l3.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep if line4 > " "
{txt}(464 observations deleted)

{com}.         keep line line4
{txt}
{com}. save l4
{txt}file l4.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep if line5 > " "
{txt}(471 observations deleted)

{com}.         keep line line5
{txt}
{com}. save l5
{txt}file l5.dta saved

{com}. 
. use aggfile1
{txt}
{com}.         keep if line6 > " "
{txt}(126 observations deleted)

{com}.         keep ucc line line6
{txt}
{com}.         sort line
{txt}
{com}. save l6
{txt}file l6.dta saved

{com}. 
. use l
{txt}
{com}.         cross using l1
{txt}
{com}.         drop if line1 > line
{txt}(5472 observations deleted)

{com}.         gsort +line -line1
{txt}
{com}.         duplicates drop line, force

{p 0 4}{txt}Duplicates in terms of {res} line{p_end}

{txt}(3781 observations deleted)

{com}. save c1
{txt}file c1.dta saved

{com}. 
. cross using l2
{txt}
{com}.         drop if line2 > line
{txt}(12498 observations deleted)

{com}.         gsort +line -line2
{txt}
{com}.         duplicates drop line, force

{p 0 4}{txt}Duplicates in terms of {res} line{p_end}

{txt}(4095 observations deleted)

{com}. save c2
{txt}file c2.dta saved

{com}. 
. cross using l3
{txt}
{com}.         drop if line3 > line
{txt}(7121 observations deleted)

{com}.         gsort +line -line3
{txt}
{com}.         duplicates drop line, force

{p 0 4}{txt}Duplicates in terms of {res} line{p_end}

{txt}(6892 observations deleted)

{com}. save c3
{txt}file c3.dta saved

{com}. 
. cross using l4
{txt}
{com}.         drop if line4 > line
{txt}(2189 observations deleted)

{com}.         gsort +line -line4
{txt}
{com}.         duplicates drop line, force

{p 0 4}{txt}Duplicates in terms of {res} line{p_end}

{txt}(7734 observations deleted)

{com}. save c4
{txt}file c4.dta saved

{com}. 
. cross using l5
{txt}
{com}.         drop if line5 > line
{txt}(1032 observations deleted)

{com}.         gsort +line -line5
{txt}
{com}.         duplicates drop line, force

{p 0 4}{txt}Duplicates in terms of {res} line{p_end}

{txt}(5725 observations deleted)

{com}. save c5
{txt}file c5.dta saved

{com}. 
. use l
{txt}
{com}. merge line using c1 c2 c3 c4 c5 l6, sort
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}.         drop _merge* line
{txt}
{com}.         drop if line6==""
{txt}(126 observations deleted)

{com}. sort ucc
{txt}
{com}. 
. stack  ucc line6 line1  ucc line6 line2  ucc line6 line3  ///
>        ucc line6 line4  ucc line6 line5  ucc line6 line6  ///
>        ,into(ucc compare line)  clear
{txt}
{com}. drop if line==""
{txt}(121 observations deleted)

{com}. 
. keep if substr(compare,6,1) > substr(line,6,1) | compare==line
{txt}(602 observations deleted)

{com}.         sort ucc line
{txt}
{com}.         drop _stack compare
{txt}
{com}. save aggfile
{txt}file aggfile.dta saved

{com}. 
. 
. use fmld111
{txt}
{com}. keep newid finlwt21 inclass
{txt}
{com}.         append using fmld112, keep(newid finlwt21 inclass)
{txt}
{com}.         append using fmld113, keep(newid finlwt21 inclass)
{txt}
{com}.         append using fmld114, keep(newid finlwt21 inclass)
{txt}
{com}. generate weight=finlwt21/4
{txt}
{com}. sort newid
{txt}
{com}. describe

{txt}Contains data from {res}fmld111.dta
{txt}  obs:{res}        13,925                          
{txt} vars:{res}             4                          
{txt} size:{res}       306,350{txt} (99.9% of memory free)
{hline}
              storage  display     value
variable name   type   format      label      variable label
{hline}
{p 0 48}{res}{bind:newid          }{txt}{bind: long   }{bind:{txt}%12.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:finlwt21       }{txt}{bind: double }{bind:{txt}%10.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inclass        }{txt}{bind: str2   }{bind:{txt}%2s        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:weight         }{txt}{bind: float  }{bind:{txt}%9.0g      }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by:  {res}newid
     Note:  dataset has changed since last saved
{txt}
{com}. list newid inclass finlwt21 weight in 1/15, divider
{txt}
     {c TLC}{hline 9}{c TT}{hline 9}{c TT}{hline 11}{c TT}{hline 10}{c TRC}
     {c |} {res}  newid {txt}{c |} {res}inclass {txt}{c |} {res} finlwt21 {txt}{c |} {res}  weight {txt}{c |}
     {c LT}{hline 9}{c +}{hline 9}{c +}{hline 11}{c +}{hline 10}{c RT}
  1. {c |} {res}1166231 {txt}{c |} {res}     06 {txt}{c |} {res}26849.633 {txt}{c |} {res}6712.408 {txt}{c |}
  2. {c |} {res}1166232 {txt}{c |} {res}     06 {txt}{c |} {res}26849.633 {txt}{c |} {res}6712.408 {txt}{c |}
  3. {c |} {res}1166241 {txt}{c |} {res}     08 {txt}{c |} {res}29302.524 {txt}{c |} {res}7325.631 {txt}{c |}
  4. {c |} {res}1166242 {txt}{c |} {res}     08 {txt}{c |} {res}29302.524 {txt}{c |} {res}7325.631 {txt}{c |}
  5. {c |} {res}1166251 {txt}{c |} {res}     09 {txt}{c |} {res} 7836.275 {txt}{c |} {res}1959.069 {txt}{c |}
     {c LT}{hline 9}{c +}{hline 9}{c +}{hline 11}{c +}{hline 10}{c RT}
  6. {c |} {res}1166252 {txt}{c |} {res}     09 {txt}{c |} {res} 7836.275 {txt}{c |} {res}1959.069 {txt}{c |}
  7. {c |} {res}1166261 {txt}{c |} {res}     09 {txt}{c |} {res}39516.475 {txt}{c |} {res}9879.119 {txt}{c |}
  8. {c |} {res}1166262 {txt}{c |} {res}     09 {txt}{c |} {res}39516.475 {txt}{c |} {res}9879.119 {txt}{c |}
  9. {c |} {res}1166291 {txt}{c |} {res}     07 {txt}{c |} {res}42134.707 {txt}{c |} {res}10533.68 {txt}{c |}
 10. {c |} {res}1166292 {txt}{c |} {res}     07 {txt}{c |} {res}42134.707 {txt}{c |} {res}10533.68 {txt}{c |}
     {c LT}{hline 9}{c +}{hline 9}{c +}{hline 11}{c +}{hline 10}{c RT}
 11. {c |} {res}1166311 {txt}{c |} {res}     07 {txt}{c |} {res}28425.552 {txt}{c |} {res}7106.388 {txt}{c |}
 12. {c |} {res}1166312 {txt}{c |} {res}     07 {txt}{c |} {res}28425.552 {txt}{c |} {res}7106.388 {txt}{c |}
 13. {c |} {res}1166341 {txt}{c |} {res}     05 {txt}{c |} {res}51953.532 {txt}{c |} {res}12988.38 {txt}{c |}
 14. {c |} {res}1166342 {txt}{c |} {res}     05 {txt}{c |} {res}51953.532 {txt}{c |} {res}12988.38 {txt}{c |}
 15. {c |} {res}1166351 {txt}{c |} {res}     05 {txt}{c |} {res}22892.688 {txt}{c |} {res}5723.172 {txt}{c |}
     {c BLC}{hline 9}{c BT}{hline 9}{c BT}{hline 11}{c BT}{hline 10}{c BRC}

{com}. save fmly
{txt}file fmly.dta saved

{com}. 
. use dtbd111
{txt}
{com}. keep newid ucc amount
{txt}
{com}.         append using dtbd112, keep(newid ucc amount)
{txt}
{com}.         append using dtbd113, keep(newid ucc amount)
{txt}
{com}.         append using dtbd114, keep(newid ucc amount)
{txt}
{com}. rename amount cost
{txt}
{com}.         append using expd111, keep(newid ucc cost)
{txt}cost was {res}long{txt} now {res}double
{txt}
{com}.         append using expd112, keep(newid ucc cost)
{txt}
{com}.         append using expd113, keep(newid ucc cost)
{txt}
{com}.         append using expd114, keep(newid ucc cost)
{txt}
{com}. sort newid
{txt}
{com}. describe

{txt}Contains data from {res}dtbd111.dta
{txt}  obs:{res}       729,882                          
{txt} vars:{res}             3                          
{txt} size:{res}    16,057,404{txt} (92.3% of memory free)
{hline}
              storage  display     value
variable name   type   format      label      variable label
{hline}
{p 0 48}{res}{bind:newid          }{txt}{bind: long   }{bind:{txt}%12.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ucc            }{txt}{bind: str6   }{bind:{txt}%6s        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cost           }{txt}{bind: double }{bind:{txt}%12.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by:  {res}newid
     Note:  dataset has changed since last saved
{txt}
{com}. list newid ucc cost in 1/15, divider
{txt}
     {c TLC}{hline 9}{c TT}{hline 8}{c TT}{hline 7}{c TRC}
     {c |} {res}  newid {txt}{c |} {res}   ucc {txt}{c |} {res} cost {txt}{c |}
     {c LT}{hline 9}{c +}{hline 8}{c +}{hline 7}{c RT}
  1. {c |} {res}1166231 {txt}{c |} {res}190322 {txt}{c |} {res}    5 {txt}{c |}
  2. {c |} {res}1166231 {txt}{c |} {res}100510 {txt}{c |} {res}    2 {txt}{c |}
  3. {c |} {res}1166231 {txt}{c |} {res}980330 {txt}{c |} {res}  100 {txt}{c |}
  4. {c |} {res}1166231 {txt}{c |} {res}900030 {txt}{c |} {res}19714 {txt}{c |}
  5. {c |} {res}1166231 {txt}{c |} {res}470111 {txt}{c |} {res} 9.55 {txt}{c |}
     {c LT}{hline 9}{c +}{hline 8}{c +}{hline 7}{c RT}
  6. {c |} {res}1166231 {txt}{c |} {res}980090 {txt}{c |} {res}  100 {txt}{c |}
  7. {c |} {res}1166231 {txt}{c |} {res}180710 {txt}{c |} {res} 1.46 {txt}{c |}
  8. {c |} {res}1166231 {txt}{c |} {res}180710 {txt}{c |} {res}  .99 {txt}{c |}
  9. {c |} {res}1166231 {txt}{c |} {res}120410 {txt}{c |} {res} 1.09 {txt}{c |}
 10. {c |} {res}1166231 {txt}{c |} {res}020510 {txt}{c |} {res}  2.5 {txt}{c |}
     {c LT}{hline 9}{c +}{hline 8}{c +}{hline 7}{c RT}
 11. {c |} {res}1166231 {txt}{c |} {res}020620 {txt}{c |} {res} 1.97 {txt}{c |}
 12. {c |} {res}1166231 {txt}{c |} {res}120410 {txt}{c |} {res}  .42 {txt}{c |}
 13. {c |} {res}1166231 {txt}{c |} {res}120210 {txt}{c |} {res}  .94 {txt}{c |}
 14. {c |} {res}1166231 {txt}{c |} {res}170532 {txt}{c |} {res}   .8 {txt}{c |}
 15. {c |} {res}1166231 {txt}{c |} {res}160212 {txt}{c |} {res} 1.68 {txt}{c |}
     {c BLC}{hline 9}{c BT}{hline 8}{c BT}{hline 7}{c BRC}

{com}. save expend
{txt}file expend.dta saved

{com}. 
. use fmly
{txt}
{com}.         joinby newid using expend, unmatched(using)
{txt}
{com}. generate wtcost=cost*weight
{txt}
{com}. sort ucc
{txt}
{com}. describe

{txt}Contains data
  obs:{res}       729,882                          
{txt} vars:{res}             8                          
{txt} size:{res}    29,925,162{txt} (85.7% of memory free)
{hline}
              storage  display     value
variable name   type   format      label      variable label
{hline}
{p 0 48}{res}{bind:newid          }{txt}{bind: long   }{bind:{txt}%12.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:finlwt21       }{txt}{bind: double }{bind:{txt}%10.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inclass        }{txt}{bind: str2   }{bind:{txt}%2s        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:weight         }{txt}{bind: float  }{bind:{txt}%9.0g      }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_merge         }{txt}{bind: byte   }{bind:{txt}%29.0g     }{space 1}{bind:__MERGE  }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ucc            }{txt}{bind: str6   }{bind:{txt}%6s        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cost           }{txt}{bind: double }{bind:{txt}%12.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:wtcost         }{txt}{bind: float  }{bind:{txt}%9.0g      }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by:  {res}ucc
     Note:  dataset has changed since last saved
{txt}
{com}. list newid inclass ucc weight cost wtcost in 1/15, divider
{txt}
     {c TLC}{hline 9}{c TT}{hline 9}{c TT}{hline 8}{c TT}{hline 10}{c TT}{hline 11}{c TT}{hline 10}{c TRC}
     {c |} {res}  newid {txt}{c |} {res}inclass {txt}{c |} {res}   ucc {txt}{c |} {res}  weight {txt}{c |} {res}     cost {txt}{c |} {res}  wtcost {txt}{c |}
     {c LT}{hline 9}{c +}{hline 9}{c +}{hline 8}{c +}{hline 10}{c +}{hline 11}{c +}{hline 10}{c RT}
  1. {c |} {res}1241861 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}9265.345 {txt}{c |} {res}    54.13 {txt}{c |} {res}501533.1 {txt}{c |}
  2. {c |} {res}1215571 {txt}{c |} {res}     08 {txt}{c |} {res}001000 {txt}{c |} {res} 10250.8 {txt}{c |} {res}     26.5 {txt}{c |} {res}271646.1 {txt}{c |}
  3. {c |} {res}1241862 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}9265.345 {txt}{c |} {res}    54.13 {txt}{c |} {res}501533.1 {txt}{c |}
  4. {c |} {res}1186761 {txt}{c |} {res}     04 {txt}{c |} {res}001000 {txt}{c |} {res}8184.856 {txt}{c |} {res}     54.3 {txt}{c |} {res}444437.7 {txt}{c |}
  5. {c |} {res}1188361 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}5556.232 {txt}{c |} {res}     53.5 {txt}{c |} {res}297258.4 {txt}{c |}
     {c LT}{hline 9}{c +}{hline 9}{c +}{hline 8}{c +}{hline 10}{c +}{hline 11}{c +}{hline 10}{c RT}
  6. {c |} {res}1254992 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}1155.903 {txt}{c |} {res}     51.5 {txt}{c |} {res}59529.03 {txt}{c |}
  7. {c |} {res}1183542 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}6617.901 {txt}{c |} {res}    26.81 {txt}{c |} {res}177425.9 {txt}{c |}
  8. {c |} {res}1253551 {txt}{c |} {res}     05 {txt}{c |} {res}001000 {txt}{c |} {res}6348.685 {txt}{c |} {res}6170.3767 {txt}{c |} {res}3.92e+07 {txt}{c |}
  9. {c |} {res}1254992 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}1155.903 {txt}{c |} {res}     51.5 {txt}{c |} {res}59529.03 {txt}{c |}
 10. {c |} {res}1269131 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}6441.916 {txt}{c |} {res}   110.25 {txt}{c |} {res}710221.2 {txt}{c |}
     {c LT}{hline 9}{c +}{hline 9}{c +}{hline 8}{c +}{hline 10}{c +}{hline 11}{c +}{hline 10}{c RT}
 11. {c |} {res}1222241 {txt}{c |} {res}     07 {txt}{c |} {res}001000 {txt}{c |} {res}5114.636 {txt}{c |} {res}    215.7 {txt}{c |} {res} 1103227 {txt}{c |}
 12. {c |} {res}1181602 {txt}{c |} {res}     08 {txt}{c |} {res}001000 {txt}{c |} {res}14378.03 {txt}{c |} {res}   266.25 {txt}{c |} {res} 3828151 {txt}{c |}
 13. {c |} {res}1178382 {txt}{c |} {res}     08 {txt}{c |} {res}001000 {txt}{c |} {res}7542.207 {txt}{c |} {res}       53 {txt}{c |} {res}399736.9 {txt}{c |}
 14. {c |} {res}1269352 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}8622.513 {txt}{c |} {res}    97.23 {txt}{c |} {res}838366.9 {txt}{c |}
 15. {c |} {res}1188362 {txt}{c |} {res}     09 {txt}{c |} {res}001000 {txt}{c |} {res}5556.232 {txt}{c |} {res}     53.5 {txt}{c |} {res}297258.4 {txt}{c |}
     {c BLC}{hline 9}{c BT}{hline 9}{c BT}{hline 8}{c BT}{hline 10}{c BT}{hline 11}{c BT}{hline 10}{c BRC}

{com}. save tabdata
{txt}file tabdata.dta saved

{com}. 
. use fmly
{txt}
{com}.         statsby pops=r(sum), saving(pops1) by(inclass, missing) nodots: sum weight
{p2colset 7 17 21 2}{...}

{txt}{p2col :command:}summarize weight{p_end}
{p2colset 10 17 21 2}{...}
{p2col :pops:}{res:r(sum)}{p_end}
           by:  inclass


{com}. 
. use pops1
{txt}(statsby: summarize)

{com}.       gen _varname="pop"+inclass
{txt}
{com}.       drop inclass
{txt}
{com}.       xpose, clear varname
{txt}
{com}.       egen pop10=rsum(pop01-pop09)
{txt}
{com}.       xpose, clear varname
{txt}
{com}.       gen inclass=substr(_varname,4,2)
{txt}
{com}.       drop _varname
{txt}
{com}. save pops
{txt}file pops.dta saved

{com}. 
. use tabdata
{txt}
{com}.         statsby aggs=r(sum), saving(agg1) by(inclass ucc, missing) nodots: sum wtcost
{p2colset 7 17 21 2}{...}

{txt}{p2col :command:}summarize wtcost{p_end}
{p2colset 10 17 21 2}{...}
{p2col :aggs:}{res:r(sum)}{p_end}
           by:  inclass ucc


{com}. 
. use agg1
{txt}(statsby: summarize)

{com}.       reshape wide aggs, i(ucc) j(inclass) string
{txt}(note: j = 01 02 03 04 05 06 07 08 09)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}    4369   {txt}->{res}     577
{txt}Number of variables            {res}       3   {txt}->{res}      10
{txt}j variable (9 values)           {res}inclass   {txt}->   (dropped)
xij variables:
                                   {res}aggs   {txt}->   {res}aggs01 aggs02 ... aggs09
{txt}{hline 77}

{com}.       egen aggs10=rsum(aggs01-aggs09)
{txt}
{com}.       reshape long aggs, i(ucc) j(inclass) string
{txt}(note: j = 01 02 03 04 05 06 07 08 09 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     577   {txt}->{res}    5770
{txt}Number of variables            {res}      11   {txt}->{res}       3
{txt}j variable (10 values)                    ->   {res}inclass
{txt}xij variables:
               {res}aggs01 aggs02 ... aggs10   {txt}->   {res}aggs
{txt}{hline 77}

{com}. save agg2
{txt}file agg2.dta saved

{com}. 
. use pops
{txt}
{com}.         joinby inclass using agg2, unmatched(using)
{txt}
{com}.         generate uccmean=aggs/pops
{txt}(824 missing values generated)

{com}.         format pops aggs uccmean %16.2g
{txt}
{com}. describe

{txt}Contains data
  obs:{res}         5,770                          
{txt} vars:{res}             6                          
{txt} size:{res}       144,250{txt} (99.9% of memory free)
{hline}
              storage  display     value
variable name   type   format      label      variable label
{hline}
{p 0 48}{res}{bind:pops           }{txt}{bind: float  }{bind:{txt}%16.2g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inclass        }{txt}{bind: str2   }{bind:{txt}%9s        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_merge         }{txt}{bind: byte   }{bind:{txt}%29.0g     }{space 1}{bind:__MERGE  }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ucc            }{txt}{bind: str6   }{bind:{txt}%9s        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:aggs           }{txt}{bind: float  }{bind:{txt}%16.2g     }{space 1}{bind:         }{bind:  }{res}{res}r(sum){p_end}
{p 0 48}{bind:uccmean        }{txt}{bind: float  }{bind:{txt}%16.2g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by:  
{res}     Note:  dataset has changed since last saved
{txt}
{com}. list inclass ucc pops aggs uccmean in 1/15, divider
{txt}
     {c TLC}{hline 9}{c TT}{hline 8}{c TT}{hline 9}{c TT}{hline 11}{c TT}{hline 9}{c TRC}
     {c |} {res}inclass {txt}{c |} {res}   ucc {txt}{c |} {res}   pops {txt}{c |} {res}     aggs {txt}{c |} {res}uccmean {txt}{c |}
     {c LT}{hline 9}{c +}{hline 8}{c +}{hline 9}{c +}{hline 11}{c +}{hline 9}{c RT}
  1. {c |} {res}     01 {txt}{c |} {res}270000 {txt}{c |} {res}3274894 {txt}{c |} {res} 42613152 {txt}{c |} {res}     13 {txt}{c |}
  2. {c |} {res}     01 {txt}{c |} {res}100510 {txt}{c |} {res}3274894 {txt}{c |} {res}  1427054 {txt}{c |} {res}    .44 {txt}{c |}
  3. {c |} {res}     01 {txt}{c |} {res}290120 {txt}{c |} {res}3274894 {txt}{c |} {res}  3187883 {txt}{c |} {res}    .97 {txt}{c |}
  4. {c |} {res}     01 {txt}{c |} {res}390120 {txt}{c |} {res}3274894 {txt}{c |} {res}   227012 {txt}{c |} {res}   .069 {txt}{c |}
  5. {c |} {res}     01 {txt}{c |} {res}480214 {txt}{c |} {res}3274894 {txt}{c |} {res}        . {txt}{c |} {res}      . {txt}{c |}
     {c LT}{hline 9}{c +}{hline 8}{c +}{hline 9}{c +}{hline 11}{c +}{hline 9}{c RT}
  6. {c |} {res}     01 {txt}{c |} {res}340906 {txt}{c |} {res}3274894 {txt}{c |} {res}        . {txt}{c |} {res}      . {txt}{c |}
  7. {c |} {res}     01 {txt}{c |} {res}980060 {txt}{c |} {res}3274894 {txt}{c |} {res}   687040 {txt}{c |} {res}    .21 {txt}{c |}
  8. {c |} {res}     01 {txt}{c |} {res}530902 {txt}{c |} {res}3274894 {txt}{c |} {res}        . {txt}{c |} {res}      . {txt}{c |}
  9. {c |} {res}     01 {txt}{c |} {res}470211 {txt}{c |} {res}3274894 {txt}{c |} {res}   236291 {txt}{c |} {res}   .072 {txt}{c |}
 10. {c |} {res}     01 {txt}{c |} {res}900132 {txt}{c |} {res}3274894 {txt}{c |} {res}546455296 {txt}{c |} {res}    167 {txt}{c |}
     {c LT}{hline 9}{c +}{hline 8}{c +}{hline 9}{c +}{hline 11}{c +}{hline 9}{c RT}
 11. {c |} {res}     01 {txt}{c |} {res}360330 {txt}{c |} {res}3274894 {txt}{c |} {res}  1295135 {txt}{c |} {res}     .4 {txt}{c |}
 12. {c |} {res}     01 {txt}{c |} {res}610140 {txt}{c |} {res}3274894 {txt}{c |} {res}        . {txt}{c |} {res}      . {txt}{c |}
 13. {c |} {res}     01 {txt}{c |} {res}290420 {txt}{c |} {res}3274894 {txt}{c |} {res}        . {txt}{c |} {res}      . {txt}{c |}
 14. {c |} {res}     01 {txt}{c |} {res}360210 {txt}{c |} {res}3274894 {txt}{c |} {res}  1521137 {txt}{c |} {res}    .46 {txt}{c |}
 15. {c |} {res}     01 {txt}{c |} {res}070240 {txt}{c |} {res}3274894 {txt}{c |} {res}   993993 {txt}{c |} {res}     .3 {txt}{c |}
     {c BLC}{hline 9}{c BT}{hline 8}{c BT}{hline 9}{c BT}{hline 11}{c BT}{hline 9}{c BRC}

{com}.         sort inclass ucc
{txt}
{com}.         keep inclass ucc uccmean
{txt}
{com}. save tab1
{txt}file tab1.dta saved

{com}. 
. reshape wide uccmean, i(ucc) j(inclass) string
{txt}(note: j = 01 02 03 04 05 06 07 08 09 10)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}    5770   {txt}->{res}     577
{txt}Number of variables            {res}       3   {txt}->{res}      11
{txt}j variable (10 values)          {res}inclass   {txt}->   (dropped)
xij variables:
                                {res}uccmean   {txt}->   {res}uccmean01 uccmean02 ... uccmean10
{txt}{hline 77}

{com}. save tab2
{txt}file tab2.dta saved

{com}. 
. merge ucc using aggfile
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4}
variable{txt} ucc
does not uniquely identify observations in
aggfile.dta
{p_end}

{com}.         keep if _merge==3
{txt}(271 observations deleted)

{com}.         drop _merge
{txt}
{com}.         sort line
{txt}
{com}.                 by line, sort: egen Inclass01 = sum(uccmean01)
{txt}
{com}.                 by line, sort: egen Inclass02 = sum(uccmean02)
{txt}
{com}.                 by line, sort: egen Inclass03 = sum(uccmean03)
{txt}
{com}.                 by line, sort: egen Inclass04 = sum(uccmean04)
{txt}
{com}.                 by line, sort: egen Inclass05 = sum(uccmean05)
{txt}
{com}.                 by line, sort: egen Inclass06 = sum(uccmean06)
{txt}
{com}.                 by line, sort: egen Inclass07 = sum(uccmean07)
{txt}
{com}.                 by line, sort: egen Inclass08 = sum(uccmean08)
{txt}
{com}.                 by line, sort: egen Inclass09 = sum(uccmean09)
{txt}
{com}.                 by line, sort: egen Inclass10 = sum(uccmean10)
{txt}
{com}.         drop ucc uccmean*
{txt}
{com}.         duplicates drop line, force

{p 0 4}{txt}Duplicates in terms of {res} line{p_end}

{txt}(930 observations deleted)

{com}. save tab
{txt}file tab.dta saved

{com}. 
. use lblfile
{txt}
{com}. merge line using tab
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}.         keep if _merge==3
{txt}(11 observations deleted)

{com}.                 format Inclass01 %10.2fc
{txt}
{com}.                 format Inclass02 %10.2fc
{txt}
{com}.                 format Inclass03 %10.2fc
{txt}
{com}.                 format Inclass04 %10.2fc
{txt}
{com}.                 format Inclass05 %10.2fc
{txt}
{com}.                 format Inclass06 %10.2fc
{txt}
{com}.                 format Inclass07 %10.2fc
{txt}
{com}.                 format Inclass08 %10.2fc
{txt}
{com}.                 format Inclass09 %10.2fc
{txt}
{com}.                 format Inclass10 %10.2fc
{txt}
{com}.                 label variable Inclass01 "Less than $5,000"
{txt}
{com}.                 label variable Inclass02 "$5,000 to $9,999"
{txt}
{com}.                 label variable Inclass03 "$10,000 to $14,999"
{txt}
{com}.                 label variable Inclass04 "$15,000 to $19,999"
{txt}
{com}.                 label variable Inclass05 "$20,000 to $29,000"
{txt}
{com}.                 label variable Inclass06 "$30,000 to $39,999"
{txt}
{com}.                 label variable Inclass07 "$40,000 to $49,999"
{txt}
{com}.                 label variable Inclass08 "$50,000 to $69,999"
{txt}
{com}.                 label variable Inclass09 "$70,000 and over"
{txt}
{com}.                 label variable Inclass10 "Incomplete Reporters"
{txt}
{com}.                 label variable title "Item"
{txt}
{com}.         drop line _merge
{txt}
{com}. save DiaryTable
{txt}file DiaryTable.dta saved

{com}. 
. outsheet  title Inclass01 Inclass02 Inclass03 Inclass04 Inclass05 ///
>                 Inclass06 Inclass07 Inclass08 Inclass09 Inclass10 ///
>           using DiaryTable, noquote
{txt}
{com}. 
{txt}end of do-file

{com}. 